# Taps
tap 'homebrew/cask'
tap "homebrew/cask-fonts"
tap 'homebrew/bundle'

# Formulae
brew "bat"
brew "exa"
brew "fzf"
brew "git-delta"
brew "git"
brew "gum"
brew "lazygit"
brew "neovim"
brew "starship"
brew "thefuck"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "zsh-you-should-use"
brew "zoxide"

# Apps
cask "alacritty"
cask "font-hack-nerd-font"
cask "karabiner-elements"
